In [2]:
import pandas as pd

In [3]:
data_users = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
           21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33],
    'name': [
        'Bruce Willis', 'George Clooney', 'Kevin Costner', 'Donald Sutherland', 'Jennifer Lopez',
        'Ray Liotta', 'Samuel L. Jackson', 'Nikole Kidman', 'Alan Rickman', 'Kurt Russell',
        'Harrison Ford', 'Russell Crowe', 'Steve Martin', 'Michael Caine', 'Angelina Jolie',
        'Mel Gibson', 'Michael Douglas', 'John Travolta', 'Sylvester Stallone', 'Tommy Lee Jones',
        'Catherine Zeta-Jones', 'Antonio Banderas', 'Kim Basinger', 'Sam Neill', 'Hideo Kojima',
        'ClINT Eastwood', 'Brad Pitt', 'Johnny Depp', 'Pierce Brosnan', 'Sean Connery',
        'Bruce Willis', 'Mullah Omar', 'Vasanta Roberta'
    ],
    'email': [
        'barjam@hotmail.com', 'tellis@me.com', 'metzzo@superhotmail.com', 'ralamosm@verizon.net',
        'barjam@hotmail.com', 'jdhedden@comcast.net', 'moonlapse@outlook.com', 'okroeger@msn.com',
        'karasik@verizon.net', 'gator@live.com', 'kostas@hotmail.com', 'glenz@att.net',
        'nelson@outlook.com', 'dmouse@live.com', 'chance@att.net', 'rohitm@yahoo.ca',
        'timtroyr@hotmail.com', 'wainwrig@msn.com', 'kohlis@aol.com', 'szymansk@live.com',
        'flakeg@hotmail.com', 'sassen@verizon.net', 'jaesenj@sbcglobal.net', 'clkao@live.com',
        'admin@sql-academy.org', 'froodian@verizon.net', 'kewley@optonline.net', 'cgarcia@yahoo.ca',
        'treeves@icloud.com', 'jschauma@icloud.com', 'kewley@icloud.com', 'jgoerzen@me.com',
        'roberta@me.com'
    ],
    'email_verified_at': [
        None, '2016-02-22T00:17:42.000Z', '2016-03-26T00:01:52.000Z', '2016-11-03T13:01:34.000Z',
        '2016-03-02T09:35:57.000Z', '2017-02-24T04:08:45.000Z', '2018-07-19T11:16:13.000Z',
        '2016-09-17T14:47:01.000Z', '2016-10-03T14:47:09.000Z', '2016-08-18T22:26:00.000Z',
        '2016-12-05T07:35:14.000Z', '2018-01-04T21:20:27.000Z', '2016-07-29T04:25:00.000Z',
        '2016-04-24T01:31:46.000Z', None, '2016-01-02T11:42:58.000Z', '2016-08-02T12:50:51.000Z',
        '2016-11-19T12:30:43.000Z', '2018-10-04T00:16:57.000Z', '2018-03-09T11:08:34.000Z',
        '2016-04-02T12:28:19.000Z', '2018-03-23T08:15:47.000Z', '2017-09-27T00:28:22.000Z',
        '2017-02-05T22:24:13.000Z', '2017-03-08T14:15:51.000Z', '2019-02-10T09:43:59.000Z',
        '2017-02-11T05:45:15.000Z', '2017-05-26T01:19:06.000Z', '2019-03-08T01:56:00.000Z',
        '2016-05-21T00:45:17.000Z', '2016-12-08T20:18:59.000Z', '2019-07-18T06:50:42.000Z',
        '2017-08-11T06:43:43.000Z'
    ],
    'password': [
        'o8sdffsmgtswxjvxxl31', 'sx8pav3ggtvfwdz1yte7', 'l51q47urv4hbqqa5f87g', 'pj2625765oehrlpk6lo4',
        'c70n1nz39ggc9881ybst', 'qpnuvi7mndgl1qmxgdl1', 'i6yvht95527z3idgqx9y', '3bhg1l720u1reugsmbfc',
        '86ezqmymrhof0w81x3n9', '4wwzx2kpn81410q79ieh', 'u8sxb8byhaajee65n9t2', 'ywtkc8tns9le6aioalyf',
        'w76yphg3kvzg77ilmxfs', '7k6m698ky9de34yc9zrh', 'f403jj1cpkzoiwicn0kz', 'hojjtsy7rt0v7we42vlr',
        '03ga9r324u8n25ujb5ue', 'fzjhl0v82o0amalr8649', 'b26226km8w1qfzqpi9so', 'c46s9eodm9k3qiwvju3y',
        'izq356fwuzdhc6u1skan', 'wftjnqkjfqi7dj7g6oeo', 'h60m7wovjopzp9kx4m3m', '3rpgiccs25fj7apg246s',
        '97shpolky5vg3b2qn2wu', 'ogbjpnp7vlzwxu4bj0bs', '829j2ygocn8btzae49kv', 'qpp6hbnae42cdhmxlk4j',
        'lqiwecclne9rv8woo2go', 'lyh4jkdxkvtvulvqi5db', '0ofa2khvnptiackbssv0', 'f3ft4fwo7vafvqb0ugk5',
        'f3ftsdfsdffvqb0ugk5'
    ],
    'phone_number': [
        '+1 202 555 0128', '+1 202 555 0145', '+1 202 555 0197', '+1 202 555 0161', '+1 202 555 0145',
        '+1 202 555 0166', '+1 202 555 0162', '+1 202 555 0146', '+1 202 555 0182', '+1 202 555 0134',
        '+1 202 555 0124', '+1 202 555 0171', '+1 202 555 0138', '+1 202 555 0151', '+1 202 555 0173',
        '+1 202 555 0152', '+1 202 555 0106', '+1 202 555 0176', '+353 20 910 6141', '+353 20 912 2322',
        '+353 20 911 3955', '+353 20 917 9717', '+353 20 913 3636', '+353 20 914 1612', '+7 401 452 0052',
        '+7 401 722 0912', '+7 401 741 3797', '+7 401 195 7363', '+7 401 749 3620', '+7 401 511 6783',
        '+375 154 771 3462', '+375 154 802 9505', '+11 444 812 1315'
    ]
}
data_Reservations = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 
           21, 22, 23, 24, 25, 26, 27, 28, 29, 30],
    'user_id': [1, 2, 12, 13, 17, 14, 19, 29, 32, 13, 9, 7, 15, 13, 12, 10, 11, 27, 28, 1, 2, 12, 12, 7, 18, 21, 31, 21, 21, 3],
    'room_id': [1, 1, 1, 1, 1, 2, 13, 16, 21, 21, 21, 19, 8, 7, 5, 5, 50, 49, 49, 49, 48, 32, 32, 19, 19, 17, 25, 14, 39, 38],
    'start_date': [
        '2018-11-13T12:00:00.000Z', '2018-10-09T12:00:00.000Z', '2018-12-29T12:00:00.000Z',
        '2019-02-01T12:00:00.000Z', '2019-02-02T12:00:00.000Z', '2020-03-21T09:00:00.000Z',
        '2020-03-21T10:00:00.000Z', '2019-06-14T10:00:00.000Z', '2019-05-11T10:00:00.000Z',
        '2019-11-04T10:00:00.000Z', '2020-02-28T10:00:00.000Z', '2020-05-01T10:00:00.000Z',
        '2020-01-19T12:00:00.000Z', '2019-09-13T10:00:00.000Z', '2020-05-14T10:00:00.000Z',
        '2020-03-26T10:00:00.000Z', '2019-11-18T11:00:00.000Z', '2019-09-18T11:00:00.000Z',
        '2020-04-01T11:00:00.000Z', '2020-06-01T10:00:00.000Z', '2019-11-07T10:00:00.000Z',
        '2020-01-14T13:00:00.000Z', '2019-09-17T13:00:00.000Z', '2020-01-08T13:00:00.000Z',
        '2019-11-01T10:00:00.000Z', '2019-11-03T09:00:00.000Z', '2020-04-20T09:00:00.000Z',
        '2020-02-08T10:00:00.000Z', '2019-12-08T10:00:00.000Z', '2020-03-20T10:00:00.000Z'
    ],
    'end_date': [
        '2018-11-15T12:00:00.000Z', '2018-10-12T12:00:00.000Z', '2019-01-07T12:00:00.000Z',
        '2019-02-02T12:00:00.000Z', '2019-02-04T12:00:00.000Z', '2020-03-23T09:00:00.000Z',
        '2020-04-21T10:00:00.000Z', '2019-06-24T10:00:00.000Z', '2019-05-14T10:00:00.000Z',
        '2019-11-06T10:00:00.000Z', '2020-02-29T10:00:00.000Z', '2020-05-02T10:00:00.000Z',
        '2020-01-21T12:00:00.000Z', '2019-09-17T10:00:00.000Z', '2020-05-15T10:00:00.000Z',
        '2020-03-27T10:00:00.000Z', '2019-11-25T11:00:00.000Z', '2019-09-20T11:00:00.000Z',
        '2020-04-02T11:00:00.000Z', '2020-06-11T10:00:00.000Z', '2019-11-10T10:00:00.000Z',
        '2020-01-18T13:00:00.000Z', '2019-09-18T13:00:00.000Z', '2020-01-11T13:00:00.000Z',
        '2019-11-16T10:00:00.000Z', '2019-11-05T09:00:00.000Z', '2020-04-22T09:00:00.000Z',
        '2020-02-12T10:00:00.000Z', '2019-12-09T10:00:00.000Z', '2020-03-23T10:00:00.000Z'
    ],
    'price': [140, 120, 180, 145, 149, 225, 89, 140, 270, 280, 290, 99, 78, 60, 80, 80, 80, 110, 115, 115, 110, 52, 52, 99, 99, 215, 120, 85, 150, 185],
    'total': [280, 360, 1620, 145, 298, 450, 2759, 1400, 810, 560, 290, 99, 156, 240, 80, 80, 560, 220, 115, 1150, 330, 208, 52, 297, 1485, 430, 240, 340, 150, 555]
}
data_Rooms = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20,
           21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40,
           41, 42, 43, 44, 45, 46, 47, 48, 49, 50],
    'home_type': [
        'Private room', 'Entire home/apt', 'Private room', 'Entire home/apt', 'Entire home/apt',
        'Entire home/apt', 'Private room', 'Private room', 'Private room', 'Entire home/apt',
        'Entire home/apt', 'Private room', 'Private room', 'Private room', 'Entire home/apt',
        'Entire home/apt', 'Entire home/apt', 'Private room', 'Entire home/apt', 'Entire home/apt',
        'Entire home/apt', 'Private room', 'Private room', 'Private room', 'Entire home/apt',
        'Private room', 'Private room', 'Entire home/apt', 'Private room', 'Entire home/apt',
        'Private room', 'Private room', 'Private room', 'Private room', 'Private room',
        'Private room', 'Private room', 'Entire home/apt', 'Private room', 'Shared room',
        'Private room', 'Entire home/apt', 'Private room', 'Private room', 'Entire home/apt',
        'Entire home/apt', 'Private room', 'Entire home/apt', 'Entire home/apt', 'Private room'
    ],
    'address': [
        '11218, Friel Place, New York', '10018, 6th Avenue, New York', '10027, West 128th Street, New York',
        '11238, Gates Avenue, New York', '10029, Park Avenue, New York', '10016, East 38th Street, New York',
        '11216, Lexington Avenue, New York', '10019, West 53rd Street, New York', '10025, West 107th Street, New York',
        '10002, Rutgers Street, New York', '10025, West 109th Street, New York', '10036, West 47th Street, New York',
        '11215, 11th Street, New York', '10025, West 106th Street, New York', '10014, Perry Street, New York',
        '11211, South 4th Street, New York', '11205, Willoughby Avenue, New York', '10011, West 21st Street, New York',
        '11216, Bergen Street, New York', '10026-2864, Duke Ellington Circle, New York', '11249, North 8th Street, New York',
        '11217, Saint Marks Avenue, New York', '11217, 5th Avenue, New York', '11217, 5th Avenue, New York',
        '11221, Hancock Street, New York', '11218, Terrace Place, New York', '10034, Seaman Avenue, New York',
        '10019, West 56th Street, New York', '10034, Post Avenue, New York', '10003, East 10th Street, New York',
        '10031, West 140th Street, New York', '10027, West 126th Street, New York', '11222, Lombardy Street, New York',
        '10031, West 138th Street, New York', '11216, Jefferson Avenue, New York', '11215, 10th Street, New York',
        '11221, Lexington Avenue, New York', '11237, Troutman Street, New York', '11226, Marlborough Road, New York',
        '10002, East Broadway, New York', '10009, East 4th Street, New York', '11215, 13th Street, New York',
        '11205, Park Avenue, New York', '10024, West 87th Street, New York', '10027, West 130th Street, New York',
        '11225, Ocean Avenue, New York', '11101, 21st Street, New York', '11207, Fulton Street, New York',
        '11221, Throop Avenue, New York', '11205, Washington Park, New York'
    ],
    'has_tv': [1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1],
    'has_internet': [1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0],
    'has_kitchen': [1, 1, 0, 0, 1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1],
    'has_air_con': [0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1],
    'price': [149, 225, 150, 89, 80, 200, 60, 79, 79, 150, 135, 85, 89, 85, 120, 140, 215, 140, 99, 190, 299, 130, 80, 110, 120, 60, 80, 150, 44, 180, 50, 52, 55, 50, 70, 89, 35, 85, 150, 40, 68, 120, 120, 135, 150, 150, 130, 110, 115, 80],
    'owner_id': [1, 1, 2, 2, 3, 3, 4, 14, 6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 32, 32, 2, 1, 25, 25, 25, 25, 12, 21, 21, 21, 26, 16, 15, 15],
    'latitude': [40.6475, 40.7536, 40.809, 40.6851, 40.7985, 40.7477, 40.6869, 40.7649, 40.8018, 40.7134, 40.8032, 40.7608, 40.6683, 40.7983, 40.7353, 40.7084, 40.6917, 40.7419, 40.6759, 40.7968, 40.7184, 40.6807, 40.6799, 40.68, 40.6837, 40.656, 40.8675, 40.7672, 40.8648, 40.7292, 40.8224, 40.813, 40.7222, 40.8213, 40.6831, 40.6687, 40.6888, 40.7019, 40.637, 40.714, 40.7229, 40.6628, 40.6967, 40.7901, 40.8117, 40.6594, 40.7477, 40.6811, 40.6855, 40.6914],
    'longitude': [-73.9724, -73.9838, -73.9419, -73.9598, -73.944, -73.975, -73.956, -73.9849, -73.9672, -73.9904, -73.9654, -73.9887, -73.9878, -73.9611, -74.0052, -73.9535, -73.9718, -73.995, -73.9469, -73.9487, -73.9572, -73.9771, -73.978, -73.9787, -73.9403, -73.9752, -73.9264, -73.9853, -73.9211, -73.9854, -73.951, -73.9547, -73.9376, -73.9532, -73.9547, -73.9878, -73.9431, -73.9275, -73.9633, -73.9892, -73.982, -73.9797, -73.9758, -73.9793, -73.9448, -73.9624, -73.9474, -73.9559, -73.9409, -73.9738]
}
data_Reviews = {
    'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22],
    'reservation_id': [1, 3, 4, 5, 8, 9, 10, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 25, 26, 28, 29, 30],
    'rating': [4, 5, 5, 5, 4, 3, 2, 2, 5, 4, 3, 2, 5, 4, 4, 4, 5, 5, 4, 1, 2, 3]
}

data_Reservations['start_date'] = pd.to_datetime(data_Reservations['start_date'])
data_Reservations['end_date'] = pd.to_datetime(data_Reservations['end_date'])
data_users['email_verified_at'] = pd.to_datetime(data_users['email_verified_at'])
Users = pd.DataFrame(data_users)
Reservations = pd.DataFrame(data_Reservations)
Rooms = pd.DataFrame(data_Rooms)
Reviews = pd.DataFrame(data_Reviews)

In [11]:
def category(price):
    if price <= 100:
        return 'economy'
    elif price >= 200:
        return 'premium'
    else:
        return 'comfort'

sep_by_price = Rooms.copy()
sep_by_price['category'] = sep_by_price['price'].apply(category)
sep_by_price = sep_by_price.groupby('category').size().reset_index(name='count')
sep_by_price

  category  count
0  comfort     22
1  economy     24
2  premium      4

In [8]:
comfortable_rooms_ordered = Rooms.merge(Reservations,how='left', left_on='id', right_on='room_id')
comfortable_rooms_ordered['days'] = (comfortable_rooms_ordered['end_date'] - comfortable_rooms_ordered['start_date']).dt.days.fillna(0)
comfortable_rooms_ordered = comfortable_rooms_ordered[(comfortable_rooms_ordered['has_air_con']==1)&(comfortable_rooms_ordered['has_internet']==1)&(comfortable_rooms_ordered['has_kitchen']==1)&(comfortable_rooms_ordered['has_tv']==1)].groupby(['home_type','address']).agg(days=('days', 'sum'), total_fee=('total', 'sum')).reset_index()
comfortable_rooms_ordered

         home_type                            address  days  total_fee
0  Entire home/apt     11216, Bergen Street, New York  19.0     1881.0
1  Entire home/apt  11249, North 8th Street, New York   6.0     1660.0
2     Private room        11217, 5th Avenue, New York   0.0        0.0
3      Shared room     10002, East Broadway, New York   0.0        0.0

In [14]:
avg_rooms_rating = Reservations.merge(Reviews, left_on='id', right_on='reservation_id').merge(Rooms, left_on='room_id', right_on='id')[['room_id', 'rating']].groupby('room_id').agg(avg_rating = ('rating', 'mean')).reset_index()
avg_rooms_rating

    room_id  avg_rating
0         1        4.75
1         5        2.50
2         7        4.00
3         8        5.00
4        14        1.00
5        16        4.00
6        17        4.00
7        19        3.50
8        21        2.50
9        38        3.00
10       39        2.00
11       48        5.00
12       49        4.00
13       50        5.00

In [ ]:
amount_reservs_per_month = Reservations.copy()
amount_reservs_per_month['year'] = amount_reservs_per_month['start_date'].dt.year
amount_reservs_per_month['month'] = amount_reservs_per_month['start_date'].dt.month
amount_reservs_per_month = amount_reservs_per_month.groupby(['year', 'month']).size().reset_index(name='amount')
amount_reservs_per_month

    year  month  amount
0   2018     10       1
1   2018     11       1
2   2018     12       1
3   2019      2       2
4   2019      5       1
5   2019      6       1
6   2019      9       3
7   2019     11       5
8   2019     12       1
9   2020      1       3
10  2020      2       2
11  2020      3       4
12  2020      4       2
13  2020      5       2
14  2020      6       1

In [13]:
domain_counts = Users.copy()
domain_counts['domain'] = domain_counts['email'].str.split('@').str[-1]
domain_counts = domain_counts[['domain']].groupby('domain').size().reset_index(name='count').sort_values(by=['count', 'domain'], ascending=[False, True]).reset_index(drop=True)
domain_counts

              domain  count
0        hotmail.com      5
1           live.com      4
2        verizon.net      4
3         icloud.com      3
4             me.com      3
5            att.net      2
6            msn.com      2
7        outlook.com      2
8           yahoo.ca      2
9            aol.com      1
10       comcast.net      1
11     optonline.net      1
12     sbcglobal.net      1
13   sql-academy.org      1
14  superhotmail.com      1

In [5]:
internet_availability_in_rooms = Rooms.copy()
internet_availability_in_rooms['has_internet'] = internet_availability_in_rooms['has_internet'].apply(lambda x: 'YES' if x == 1 else 'NO')
internet_availability_in_rooms[['id', 'has_internet']].head()

   id has_internet
0   1          YES
1   2          YES
2   3           NO
3   4           NO
4   5          YES

Задание #61  
**Комнаты, зарезервированные на 12-й неделе 2020 года**  

Выведите список комнат, которые были зарезервированы хотя бы на одни сутки в 12-ую неделю 2020 года. В данной задаче в качестве одной недели примите период из семи дней, первый из которых начинается 1 января 2020 года.  
Например, первая неделя года — 1–7 января, а третья — 15–21 января.

**Поля в результирующей таблице:**  
Rooms.*

In [12]:
rooms_in_12th_week_2020 = Reservations.merge(Rooms, left_on='room_id', right_on='id')
week_12_start = pd.Timestamp('2020-01-01', tz='UTC') + pd.Timedelta(weeks=11)
week_12_end = pd.Timestamp('2020-01-01', tz='UTC') + pd.Timedelta(weeks=12)

rooms_in_12th_week_2020 = rooms_in_12th_week_2020[(rooms_in_12th_week_2020['start_date']< week_12_end)&(rooms_in_12th_week_2020['end_date']>= week_12_start)]
rooms_in_12th_week_2020 = rooms_in_12th_week_2020.iloc[:,7:]
rooms_in_12th_week_2020

,id_y,home_type,address,has_tv,has_internet,has_kitchen,has_air_con,price_y,owner_id,latitude,longitude
5,2,Entire home/apt,"10018, 6th Avenue, New York",0,1,1,1,225,1,40.7536,-73.9838
6,13,Private room,"11215, 11th Street, New York",0,0,0,0,89,11,40.6683,-73.9878
29,38,Entire home/apt,"11237, Troutman Street, New York",1,0,1,0,85,1,40.7019,-73.9275

Задание #58   
**Добавить отзыв от George Clooney**  

Добавить отзыв с рейтингом 5 на жилье, находящиеся по адресу **"11218, Friel Place, New York"**, от имени **"George Clooney"**

В качестве первичного ключа (id) укажите количество записей в таблице + 1.  
Резервация комнаты, на которую вам нужно оставить отзыв, уже была сделана, нужно лишь ее найти.

In [21]:
George_Clooney_id = Users[Users['name'] == 'George Clooney']['id'].iloc[0]
need_room_id = Rooms[Rooms['address'] == '11218, Friel Place, New York']['id'].iloc[0]

need_reservation_id = Reservations[(Reservations['user_id']==George_Clooney_id)&(Reservations['room_id']==need_room_id)]['id'].iloc[0]

new_review = pd.DataFrame({
    'id': [Reviews['id'].max()+1],
    'reservation_id': [need_reservation_id],
    'rating': 5
})

update_reviews = pd.concat([Reviews, new_review], ignore_index=True)
update_reviews.tail()

    id  reservation_id  rating
18  19              26       4
19  20              28       1
20  21              29       2
21  22              30       3
22  23               2       5

Задание #59  
**Пользователи с белорусским номером**

Вывести пользователей,указавших Белорусский номер телефона ? Телефонный код Белоруссии +375.
  
Поля в результирующей таблице:  
*

In [27]:
users_from_Belorussia = Users[Users['phone_number'].str.startswith('+375')]
users_from_Belorussia

,id,name,email,email_verified_at,password,phone_number
30,31,Bruce Willis,kewley@icloud.com,2016-12-08 20:18:59+00:00,0ofa2khvnptiackbssv0,+375 154 771 3462
31,32,Mullah Omar,jgoerzen@me.com,2019-07-18 06:50:42+00:00,f3ft4fwo7vafvqb0ugk5,+375 154 802 9505